<?php 

//課題

for($num = 1;$num <= 100;$num ++){
    echo $num."<br>";
}


//IT用語調べ

echo "1. サブクエリ"."<br>";
echo "SQLステートメントの内部に入れ子状態で入っているSQL文（クエリ）のこと。"."<br>".
     "「SELECT * FROM (SELECT column1 FROM tbl1)」における「SELECT column1 FROM tbl1」の部分のように、入れ子になって書かれているSQL文における中に書いてある方のSQL文のこと"."<br>";
echo "2. Bootstrap"."<br>";
echo "Twitter社が開発した、cssのフレームワーク。web制作を楽にするために作られたひな型のようなもの。"."<br>";
echo "3. ライブラリ・フレームワーク"."<br>";
echo "「ライブラリ」・・・ある程度まとまったプログラムをあらかじめ作ってくれているファイルのこと。例えるなら、あらかじめ材料を切ってくれていて、すぐに料理できるように準備してくれている「カット済み野菜のようなもの」。"."<br>";
echo "「フレームワーク」・・・システム開発を楽にするために作られた、プログラムなどのひな型のこと"."<br>";
?>