<html>
    <p>I say that <?php echo "Hello World";//aiu?></p>
</html>

<?php
//IT用語調べ
echo "1.開発環境・検証環境・本番環境"."<br>";
echo "「開発環境」・・・自分のPCなどシステム開発を行う環境のこと"."<br>".
     "「検証環境」・・・開発し終わった、リリース予定の機能をテストするための環境のこと"."<br>".
     "「本番環境」・・・ユーザーが実際にシステムを使う環境のこと"."<br>";
echo "2.基本設計書・詳細設計書"."<br>";
echo "「基本設計書」・・・要件定義にもとづいて、ソフトウェアの動きを外から見た際にどういう動きをするかを確認するもの"."<br>".
     "「詳細設計書」・・・社内開発者が、開発向けに作る設計書基本設計で、決められた動きをどうやって実現するかが書かれたもの"."<br>";
echo "3.Ajax"."<br>";
echo "地図サイトのように、Webページを表示した状態のまま再読み込みを行わずにサーバ側と通信（非同期通信）を行い、動的に表示内容を変更する手法。"."<br>";
?>