<?php

//カリキュラムメモ

define("ADMIN_EMAIL","y-i-group@gmail.com");
define("LIST_COUNT","15");

echo ADMIN_EMAIL;
echo '<br>';
echo LIST_COUNT;


//IT用語調べ
echo '1. デプロイ'.'<br>';
echo '開発したアプリケーション（機能やサービス）をサーバー上に展開・配置して利用できるようにすること。'.'<br>';
echo '2. バリデーション'.'<br>';
echo '対象のデータが、その仕様や文法などに照らして適切に記述・構築されているか否かを検証すること。入力内容や記述内容が要件を満たしているか、妥当性を確認すること。'.'<br>';
echo '3. アジャイル・ウォーターフォール(開発手法)'.'<br>';
echo 'できる限り素早くリリースしようという考えに基づいている開発手法。要件定義や外部設計、内部設計などの工程を少しずつ反復して行うため、ユーザーからの要望に応じたアップデートなどに対応しやすい。'.'<br>';

?>